Revit 2027 API
FillGrid.GetPointLineZone(UV, UV) Method
 Gets the index of fill grid line and the point on the grid line nearest to the input point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetPointLineZone(
	UV point,
	out UV nearestPoint
)
Public Function GetPointLineZone (
	point As UV,
	<OutAttribute> ByRef nearestPoint As UV
) As Integer
public:
int GetPointLineZone(
	UV^ point,
	[OutAttribute] UV^% nearestPoint
)
member GetPointLineZone :
        point : UV *
        nearestPoint : UV byref -> int
Parameters
point UV
 Input point.
nearestPoint UV
 The point on the grid line nearest to the input point.
Return Value
Int32
 The index of fill grid line.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillGrid Class
GetPointLineZone Overload
Autodesk.Revit.DB Namespace